In [1]:
%load_ext sql
%sql mysql://root:05111987Olg@@localhost:3306/mysql

Условие:
Табличка:
https://drive.google.com/file/d/1PQn576YVakvlWrIgIjSP9YEf5id4cqYs/view?usp=sharing
1. Вывести на экран сколько машин каждого цвета для машин марок BMW и LADA
2. Вывести на экран марку авто и количество AUTO не этой марки

**Задание №3.**
Даны 2 таблицы, созданные следующим образом:

In [15]:
%%sql
CREATE TABLE IF NOT EXISTS test_a (
    id INT, 
    data VARCHAR(21)
);

INSERT INTO test_a (id, data) 
VALUES
(10, 'A'),
(20, 'A'),
(30, 'F'),
(40, 'D'),
(50, 'C');

 * mysql://root:***@localhost:3306/mysql
0 rows affected.
5 rows affected.

[]

In [17]:
%%sql
CREATE TABLE if not  exists test_b (id INT);
INSERT INTO test_b (id) VALUES
(10),
(30),
(50);

 * mysql://root:***@localhost:3306/mysql
0 rows affected.
3 rows affected.

[]

Задача:

Напишите запрос, который вернет строки из таблицы test_a, id которых нет в таблице test_b, НЕ используя ключевого слова NOT.

Чтобы выполнить запрос, который вернет строки из таблицы test_a, id которых отсутствует в таблице test_b, не используя ключевое слово NOT, можно использовать оператор LEFT JOIN и условие IS NULL.

In [18]:
%%sql
SELECT test_a.*
FROM test_a
LEFT JOIN test_b ON test_a.id = test_b.id
WHERE test_b.id IS NULL;

 * mysql://root:***@localhost:3306/mysql
2 rows affected.

[(20, 'A'), (40, 'D')]

In [20]:
%%sql CREATE TABLE  AUTO 
(       
	REGNUM VARCHAR(10) PRIMARY KEY, 
	MARK VARCHAR(10), 
	COLOR VARCHAR(15),
	RELEASEDT DATE, 
	PHONENUM VARCHAR(15)
);

 * mysql://root:***@localhost:3306/mysql
0 rows affected.

[]

In [22]:
%%sql
INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111114,'LADA', 'КРАСНЫЙ', date'2008-01-01', '9152222221');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111115,'VOLVO', 'КРАСНЫЙ', date'2013-01-01', '9173333334');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111116,'BMW', 'СИНИЙ', date'2015-01-01', '9173333334');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111121,'AUDI', 'СИНИЙ', date'2009-01-01', '9173333332');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111122,'AUDI', 'СИНИЙ', date'2011-01-01', '9213333336');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111113,'BMW', 'ЗЕЛЕНЫЙ', date'2007-01-01', '9214444444');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111126,'LADA', 'ЗЕЛЕНЫЙ', date'2005-01-01', null);


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111117,'BMW', 'СИНИЙ', date'2005-01-01', null);


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111119,'LADA', 'СИНИЙ', date'2017-01-01', 9213333331);

 * mysql://root:***@localhost:3306/mysql
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [23]:
%sql select * from auto

 * mysql://root:***@localhost:3306/mysql
9 rows affected.

[('111113', 'BMW', 'ЗЕЛЕНЫЙ', datetime.date(2007, 1, 1), '9214444444'),
 ('111114', 'LADA', 'КРАСНЫЙ', datetime.date(2008, 1, 1), '9152222221'),
 ('111115', 'VOLVO', 'КРАСНЫЙ', datetime.date(2013, 1, 1), '9173333334'),
 ('111116', 'BMW', 'СИНИЙ', datetime.date(2015, 1, 1), '9173333334'),
 ('111117', 'BMW', 'СИНИЙ', datetime.date(2005, 1, 1), None),
 ('111119', 'LADA', 'СИНИЙ', datetime.date(2017, 1, 1), '9213333331'),
 ('111121', 'AUDI', 'СИНИЙ', datetime.date(2009, 1, 1), '9173333332'),
 ('111122', 'AUDI', 'СИНИЙ', datetime.date(2011, 1, 1), '9213333336'),
 ('111126', 'LADA', 'ЗЕЛЕНЫЙ', datetime.date(2005, 1, 1), None)]

1. Вывести на экран сколько машин каждого цвета для машин марок BMW и LADA
2. Вывести на экран марку авто и количество AUTO не этой марки

In [27]:
%%sql
SELECT mark, color, COUNT(color) AS color_count
FROM auto
WHERE mark IN ('BMW','LADA')
GROUP BY mark, color;

 * mysql://root:***@localhost:3306/mysql
5 rows affected.

[('BMW', 'ЗЕЛЕНЫЙ', 1),
 ('LADA', 'КРАСНЫЙ', 1),
 ('BMW', 'СИНИЙ', 2),
 ('LADA', 'СИНИЙ', 1),
 ('LADA', 'ЗЕЛЕНЫЙ', 1)]

2. Вывести на экран марку авто и количество AUTO не этой марки

In [28]:
%%sql
SELECT mark, COUNT(MARK) AS MARK_count
FROM auto
WHERE mark NOT IN ('BMW','LADA')
GROUP BY mark

 * mysql://root:***@localhost:3306/mysql
2 rows affected.

[('VOLVO', 1), ('AUDI', 2)]